Revit 2027 API
ParameterTypeId.CurveTopLevel Property
 "Top Level"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveTopLevel { get; }
Public Shared ReadOnly Property CurveTopLevel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveTopLevel {
	ForgeTypeId^ get ();
}
static member CurveTopLevel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace